slides/11-apresentacoes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Apresentação Final</title>
<meta name="author" content="Lucas S. Vieira"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./slide_11.gif"><p style="font-size:0.7em;opacity:0.6;">Lucas S. Vieira</p><br/><h2>Apresentação Final</h2><br/><p style="font-size:0.85em;opacity:0.8;">Showcase dos projetos</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
</section>
<section>
<section id="slide-orgc03b20e">
<h2 id="orgc03b20e">Parabéns!</h2>
<p class="fragment (appear)">
Você chegou ao fim da Guilda de IA!
</p>

<p>
<b><b>O que você aprendeu:</b></b>
</p>
<ul>
<li>O que é IA generativa e suas limitações</li>
<li>Como criar prompts efetivos</li>
<li>Python mínimo para APIs</li>
<li>Estrutura de um agente</li>
<li>Primeira ferramenta</li>
<li>Memória e personalidade</li>
<li>Embeddings e similaridade</li>
<li>RAG básico</li>

</ul>
</section>
</section>
<section>
<section id="slide-org3475406">
<h2 id="org3475406">Formato da apresentação</h2>
<p class="fragment (appear)">
<b><b>Cada aluno tem 2-3 minutos</b></b>
</p>

<ul>
<li>Mostre o agente funcionando</li>
<li>Explique uma decisão que você tomou</li>
<li>Compartilhe uma dificuldade superada</li>
<li>(Opcional) Mostre algo que você adicionou</li>

</ul>

<blockquote  class="fragment (appear)">
<p>
Não precisa ser perfeito!
O objetivo é <b>aprender e compartilhar</b>, não impressionar.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-orgf3d3222">
<h2 id="orgf3d3222">Checklist antes de apresentar</h2>
<p>
<b><b>Funciona:</b></b>
</p>
<ul>
<li class="off"><code>[&#xa0;]</code> Agente responde perguntas básicas</li>
<li class="off"><code>[&#xa0;]</code> Ferramenta está funcionando</li>
<li class="off"><code>[&#xa0;]</code> Personalidade está clara</li>

</ul>

<p>
<b><b>Preparado:</b></b>
</p>
<ul>
<li class="off"><code>[&#xa0;]</code> Testei algumas perguntas</li>
<li class="off"><code>[&#xa0;]</code> Sei explicar o que fiz</li>
<li class="off"><code>[&#xa0;]</code> Tenho uma dificuldade para compartilhar</li>

</ul>
</section>
</section>
<section>
<section id="slide-org59ea334">
<h2 id="org59ea334">Rubrica de avaliação</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Critério</th>
<th scope="col" class="org-right">Pontos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Agente funcional</td>
<td class="org-right">40</td>
</tr>

<tr>
<td class="org-left">Explicação clara</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">Dificuldade superada</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">Criatividade</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>

<blockquote  class="fragment (appear)">
<p>
Nota: Não é sobre ter o melhor agente.
É sobre mostrar que aprendeu.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org13f3964">
<h2 id="org13f3964">Para quem terminou cedo</h2>
<p class="fragment (appear)">
Se seu agente está funcionando e você quer mais:
</p>

<p>
<b><b>Ideias de extensão:</b></b>
</p>
<ul>
<li>Adicionar outra ferramenta</li>
<li>Melhorar a personalidade</li>
<li>Implementar RAG (se não fez)</li>
<li>Testar com mais casos</li>

</ul>
</section>
</section>
<section>
<section id="slide-org19d62bd">
<h2 id="org19d62bd">Para lembrar</h2>
<blockquote  class="fragment (appear)">
<p>
"O objetivo é aprender, não impressionar."
</p>
</blockquote>

<p>
<b><b>Você agora sabe:</b></b>
</p>
<ul>
<li>Como IA generativa funciona</li>
<li>Como se comunicar com IA</li>
<li>Como construir um agente básico</li>
<li>Como dar memória ao agente</li>
<li>Como adicionar ferramentas</li>
<li>Como fazer RAG</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgfd1681d">
<h2 id="orgfd1681d">O que vem depois?</h2>
<ul>
<li class="fragment appear">Continue explorando</li>
<li class="fragment appear">Participe de outras guildas</li>
<li class="fragment appear">Construa projetos pessoais</li>
<li class="fragment appear">Compartilhe conhecimento</li>

</ul>
</section>
</section>
<section>
<section id="slide-org9c9670e">
<h2 id="org9c9670e">Obrigado!</h2>
<blockquote  class="fragment (appear)">
<p>
Continue criando, explorando e aprendendo.
</p>

<p>
A IA está transformando o mundo —
e você agora faz parte dessa transformação.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org3ce1cbb">
<h2 id="org3ce1cbb">Perguntas e Celebração!</h2>
<p class="fragment (appear)">
Dúvidas finais?
Hora de mostrar seu agente!
</p>

<p>
Vamos celebrar a jornada!</p>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
